In [1]:
import pandas as pd
import numpy as np
import re
import os
import datetime
import matplotlib.pyplot as plt
import pymysql
import sqlalchemy as alch
from sqlalchemy import inspect, MetaData, Table, select, func, Column, Integer, String
from dotenv import load_dotenv
from getpass import getpass

In [2]:
load_dotenv()

True

In [3]:
sql_password = os.getenv("Password")

In [10]:
# ********First execute the code for us_jobposts file and then spain_jobposts file********

import ast
df = pd.read_csv('../data/spain_jobposts.csv',encoding='utf-8')

# Make the array column an actual array
df['extracted_skills'] = df['extracted_skills'].apply(ast.literal_eval)

In [11]:
def get_engine():
    
    sql_password = os.getenv("Password")  
    dbName = "all_jobposts"
    connectionData = f"mysql+pymysql://root:{sql_password}@localhost:3306/{dbName}?charset=utf8mb4&use_unicode=1"
    engine = alch.create_engine(connectionData)
    return engine

engine = get_engine()
insp = inspect(engine)

In [12]:
# Inserting skills
tools = ["tableau","excel","power_bi","sas","word","powerpoint","sap","ssis","looker","qlik","alteryx",
    "spss","ssrs","outlook","dax","sharepoint","splunk","microstrategy","cognos","visio","google sheets","spreadsheet",
    "ms access","datarobot","git","github","jira","statistics"]

database = ["sql server","mysql","cassandra","postgresql","mongodb","elasticsearch","dynamodb","redis","db2","neo4j",
    "mariadb","firebase","couchbase","sqlite","firestore","couchdb","postgres","mssql"]

cloud_platforms = [ "aws","azure","snowflake","databricks","redshift","gcp","oracle","bigquery","aurora",
    "vmware","ibm cloud","firebase","watson","openstack","heroku","digital ocean", "colocation","ovh","linode"]

libraries = ["spark","hadoop","kafka","airflow","pyspark","pandas","tensorflow","pytorch","numpy","scikit-learn",
    "keras","jupyter","react","matplotlib","spring","gdpr","plotly","seaborn","graphql","nltk","opencv","ggplot2",
    "selenium","mxnet","tidyverse"]

frameworks_list = ["express","node.js","angular","flask","ruby","django","vue.js","phoenix","fastapi","jquery",
    "asp.net","ruby on rails", "react","laravel","angular.js", "asp.net core", "next.js","drupal","svelte",
    "symfony","blazor","play framework",  "gatsby"]

languages = ["python","sql","r","java","scala","nosql","sas","go","mongodb","shell","javascript","c++","c#","c",
    "matlab","vba","bash","t-sql","powershell","html","perl","css","ruby","typescript","pl/sql"]

# Function to categorize skills
def categorize_skills(skill):
    lowercase_skill = skill.lower()
    if skill in tools:
        return "Tools"
    elif skill in database:
        return "Database"
    elif skill in cloud_platforms:
        return "Cloud Platforms"
    elif skill in libraries:
        return "Libraries"
    elif skill in frameworks_list:
        return "Frameworks"
    elif skill in languages:
        return "Languages"
    else:
        return "Other"


def get_skills_with_ids(first_id):
    unique_skills = set()
    for index, row in df.iterrows():
        skills_lst = row['extracted_skills']
        for skill in skills_lst:
            if skill:
                unique_skills.add(skill)
    
    unique_skills_lst = list(unique_skills)
    skills_with_ids = [(first_id+index+1, skill, categorize_skills(skill)) for index, skill in enumerate(unique_skills_lst)]
    return skills_with_ids


# Create skills table object. Then get the latest id to avoid repeating ids
metadata = MetaData(bind=engine)
metadata.reflect()

skills_model = metadata.tables.get('skills')

# Create skills table if it doesn't exist before
if skills_model is None:
    skills_model = Table('skills',
                     metadata,
                     Column('id', Integer),
                     Column('skill', String(1000)),
                     Column('category', String(1000)))
    skills_model.create()

with engine.connect() as connection:
    latest_id = connection.execute(select([func.max(skills_model.c.id)])).scalar()

skills_with_ids = get_skills_with_ids(latest_id or 0)

# Create dataframe to make it easier to insert
df_skills_with_ids = pd.DataFrame(skills_with_ids, columns=['id', 'skill', 'category'])
    
# Filter DataFrame to exclude existing skills in the database
existing_skills_query = f"SELECT skill FROM skills"
existing_skills = pd.read_sql(existing_skills_query, con=engine)['skill']
df_to_insert = df_skills_with_ids[~df_skills_with_ids['skill'].isin(existing_skills)]

# Only insert new values
if not df_to_insert.empty:
    df_to_insert.to_sql("skills", if_exists="append", con=engine, index=False)

In [13]:
# Inserting jobs
df.drop('extracted_skills', axis=1)
df_for_insert = df.copy()
del df_for_insert['extracted_skills']
df_for_insert.to_sql("jobs", if_exists="append", con=engine, index=False)

1499

In [14]:

# First load all skills in memory
query = select([skills_model.c.id, skills_model.c.skill])

# Execute the query and fetch all skills
with engine.connect() as connection:
    result = connection.execute(query).fetchall()

skills_dict = {row['skill']: row['id'] for row in result}

# Insert jobs x skills

job_id_to_skills_lst = []

for _, row in df.iterrows():
    job_id = row['job_id']
    skills = row['extracted_skills']
    for skill in skills:
        # Search for skill in database
        skill_id = skills_dict.get(skill, None)
        if not skill_id:
            print(f"Error, couldn't find skill: {skill}")
            break
        job_id_to_skills_lst.append((job_id, skill_id))

print(f"Finished, creating list. Now we will insert into sql. {len(job_id_to_skills_lst)}")

df_job_id_to_skills = pd.DataFrame(job_id_to_skills_lst, columns=['job_id', 'skill_id'])
df_job_id_to_skills.to_sql("jobs_x_skills", if_exists="append", con=engine, index=False)

Finished, creating list. Now we will insert into sql. 5425

5425

## MySQL Queries

**Query 1: Count of Jobs by Experience Level**

In [15]:
query1 = """
SELECT search_location, experience_level, COUNT(*) as number_jobposts ,COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (PARTITION BY search_location) as percentage 
FROM jobs 
WHERE search_location IS NOT NULL 
    AND experience_level IS NOT NULL 
    AND experience_level != 'Not-Specified'
GROUP BY search_location, experience_level
ORDER BY search_location, percentage DESC;
"""

pd.read_sql_query(query1, engine)

   search_location experience_level  number_jobposts  percentage
0            Spain           Junior              590    44.83283
1            Spain       Mid-Senior              380    28.87538
2            Spain           Senior              255    19.37690
3            Spain          Manager               54     4.10334
4            Spain       Internship               30     2.27964
5            Spain         Director                7     0.53191
6    United States           Senior             4479    56.46747
7    United States           Junior             1198    15.10338
8    United States       Mid-Senior             1168    14.72516
9    United States          Manager              729     9.19062
10   United States       Internship              276     3.47958
11   United States         Director               82     1.03379

**Query 2: Most Common Job Titles**

In [40]:
query2 = "SELECT title_cleaned, COUNT(*) FROM jobs GROUP BY title_cleaned ORDER BY COUNT(*) DESC LIMIT 10;"
pd.read_sql_query(query2, engine)

               title_cleaned  COUNT(*)
0               Data Analyst     16389
1           Business Analyst      1522
2             Data Scientist      1310
3          Software Engineer       975
4              Data Engineer       877
5  Machine Learning Engineer       224
6             Cloud Engineer       117

**Query 3: Average Salary by job title (US)**

In [41]:
query3 = """
SELECT title_cleaned as job_title,AVG(salary_standardized) AS AvgSalary
FROM jobs
GROUP BY title_cleaned
ORDER BY AvgSalary DESC;
"""

pd.read_sql_query(query3, engine)

                   job_title      AvgSalary
0             Data Scientist  125814.991189
1              Data Engineer  117144.612903
2             Cloud Engineer   97705.416667
3           Business Analyst   93453.109483
4          Software Engineer   92321.286165
5               Data Analyst   91139.892189
6  Machine Learning Engineer   86004.705882

**Query 4: Average Salary by Role (US)**

In [48]:
query4= """
SELECT role, FORMAT(AVG(salary_standardized), '##,###,###.00') AS AvgSalary
FROM jobs
WHERE salary_standardized IS NOT NULL
GROUP BY role
ORDER BY AVG(salary_standardized) DESC;
"""
pd.read_sql_query(query4, engine)

                                    role AvgSalary
0                Data Scientist Director   221,875
1                  Data Engineer Manager   202,000
2                 Data Scientist Manager   171,936
3                  Data Scientist Senior   139,263
4                   Data Engineer Junior   138,833
5                  Data Analyst Director   135,005
6       Machine Learning Engineer Senior   131,733
7                   Data Engineer Senior   131,653
8              Data Scientist Mid-Senior   119,600
9                         Data Scientist   117,564
10              Software Engineer Junior   113,233
11                         Data Engineer   110,683
12                 Cloud Engineer Senior   109,375
13             Software Engineer Manager   107,850
14                  Data Analyst Manager   103,414
15                   Data Analyst Senior   102,962
16                 Data Scientist Junior   102,112
17              Data Engineer Mid-Senior   100,667
18                      Business Analyst    96,115
19                        Cloud Engineer    95,372
20               Business Analyst Senior    94,742
21              Software Engineer Senior    92,371
22                     Software Engineer    91,474
23                          Data Analyst    88,151
24             Machine Learning Engineer    86,555
25               Data Analyst Mid-Senior    84,140
26                   Data Analyst Junior    76,003
27           Business Analyst Mid-Senior    74,313
28  Machine Learning Engineer Mid-Senior    74,192
29          Software Engineer Mid-Senior    74,118
30               Business Analyst Junior    70,647
31              Business Analyst Manager    69,560
32           Business Analyst Internship    64,542
33               Data Analyst Internship    52,155
34     Machine Learning Engineer Manager    31,200

**Query 5: Top 5 Companies Posting Jobs**

In [43]:
query5 = """
SELECT search_location, company_name, job_count, 
       (job_count * 100.0 / SUM(job_count) OVER (PARTITION BY search_location)) AS percentage
FROM (
    SELECT 
        search_location, 
        company_name, 
        COUNT(*) AS job_count,
        RANK() OVER (PARTITION BY search_location ORDER BY COUNT(*) DESC) as `rank`
    FROM jobs 
    GROUP BY search_location, company_name
) subquery 
WHERE `rank` <= 5;
"""
pd.read_sql_query(query5, engine)

,search_location,company_name,job_count,percentage
0,Spain,Michael Page,29,24.36975
1,Spain,Page Personnel,27,22.68908
2,Spain,Glovo,24,20.16807
3,Spain,FRG Technology Consulting ...,20,16.80672
4,Spain,Capgemini,19,15.96639
5,United States,Upwork,3509,77.73593
6,United States,Talentify.io,507,11.23172
7,United States,Dice,224,4.96234
8,United States,Walmart,158,3.50022
9,United States,Insight Global,116,2.56978

**Query 6: Jobs Distribution by Work Modality**

In [44]:
query6 = "SELECT work_modality, COUNT(*) FROM jobs GROUP BY work_modality;"
pd.read_sql_query(query6, engine)

  work_modality  COUNT(*)
0        Remote     10310
1       On-Site      9605
2          None      1499

**Query 7: Top 10 Most Common Skills Required**

In [45]:
query7 = "SELECT skill, COUNT(*) FROM skills JOIN jobs_x_skills ON skills.id = jobs_x_skills.skill_id GROUP BY skill ORDER BY COUNT(*) DESC LIMIT 10;"
pd.read_sql_query(query7, engine)

        skill  COUNT(*)
0         sql     10451
1       excel      6622
2      python      6138
3     tableau      5233
4    power_bi      4872
5           r      3428
6         sas      1680
7        word      1612
8  powerpoint      1566
9         aws      1482

**Query 8: Top 10 Most Common Skills Required per Category**

In [94]:
pd.set_option('display.max_rows', 200)
query8 = """
SELECT category, skill, skill_count
FROM (
    SELECT 
        skills.category, 
        skills.skill, 
        COUNT(*) as skill_count,
        RANK() OVER (PARTITION BY skills.category ORDER BY COUNT(*) DESC) as skill_rank
    FROM skills 
    JOIN jobs_x_skills ON skills.id = jobs_x_skills.skill_id
    WHERE skills.category IS NOT NULL AND skills.skill IS NOT NULL
    GROUP BY skills.category, skills.skill
) subquery
WHERE skill_rank <= 15;
"""
pd.read_sql_query(query8, engine)

           category          skill  skill_count
0   Cloud Platforms            aws         1482
1   Cloud Platforms          azure         1468
2   Cloud Platforms      snowflake         1197
3   Cloud Platforms       redshift          455
4   Cloud Platforms       bigquery          407
5   Cloud Platforms            gcp          402
6   Cloud Platforms         oracle           82
7   Cloud Platforms     databricks           80
8   Cloud Platforms         aurora           42
9   Cloud Platforms         vmware            7
10  Cloud Platforms         watson            4
11  Cloud Platforms      openstack            2
12  Cloud Platforms     colocation            1
13         Database          mysql          366
14         Database     postgresql          240
15         Database        mongodb          194
16         Database       postgres          133
17         Database          mssql           59
18         Database          redis           38
19         Database  elasticsearch           24
20         Database       dynamodb           16
21         Database      cassandra           15
22         Database       firebase           10
23         Database         sqlite            4
24         Database        mariadb            2
25         Database      firestore            1
26         Database        couchdb            1
27       Frameworks           ruby           86
28       Frameworks         jquery           42
29       Frameworks        angular           34
30       Frameworks         django           31
31       Frameworks        asp.net           22
32       Frameworks          flask           20
33       Frameworks        express           17
34       Frameworks        node.js           14
35       Frameworks        fastapi           13
36       Frameworks        phoenix            3
37       Frameworks        symfony            2
38       Frameworks         svelte            1
39       Frameworks         vue.js            1
40        Languages            sql        10451
41        Languages         python         6138
42        Languages              r         3428
43        Languages             go          861
44        Languages           java          699
45        Languages              c          688
46        Languages     javascript          518
47        Languages            vba          465
48        Languages          scala          432
49        Languages          nosql          386
50        Languages           html          201
51        Languages            c++          189
52        Languages          t-sql          187
53        Languages         matlab          185
54        Languages         pl/sql          164
55        Libraries          spark          855
56        Libraries         hadoop          535
57        Libraries         pandas          384
58        Libraries        airflow          288
59        Libraries        pyspark          274
60        Libraries          numpy          235
61        Libraries     tensorflow          210
62        Libraries     matplotlib          166
63        Libraries        pytorch          147
64        Libraries        jupyter          139
65        Libraries   scikit-learn          133
66        Libraries          react          124
67        Libraries           gdpr           83
68        Libraries          keras           78
69        Libraries         plotly           70
70            Other        crystal          185
71            Other          linux          156
72            Other         docker          127
73            Other           unix          124
74            Other   visual_basic          107
75            Other       assembly           60
76            Other            nlp           53
77            Other      atlassian           51
78            Other            php           48
79            Other         gitlab           47
80            Other       terminal           43
81            Other     unix/linux           31
82            Other      bitbucket           29
83            Other             js           26
84            Other          mongo           26
85            Tools          excel         6622
86            Tools        tableau         5233
87            Tools       power_bi         4872
88            Tools            sas         1680
89            Tools           word         1612
90            Tools     powerpoint         1566
91            Tools         looker          907
92            Tools    spreadsheet          828
93            Tools            sap          812
94            Tools           jira          568
95            Tools        alteryx          553
96            Tools           spss          543
97            Tools     sharepoint          542
98            Tools        outlook          527
99            Tools           ssis          443

**Query 9: Job Posting Trends Over Time**

In [47]:
query9 = """
SELECT YEAR(posted_date) AS Year, MONTH(posted_date) AS Month, COUNT(*) AS Count
FROM jobs
GROUP BY Year, Month
ORDER BY Year, Month;
"""
pd.read_sql_query(query9, engine)

    Year  Month  Count
0   2022     11   1225
1   2022     12   1824
2   2023      1   1826
3   2023      2   1355
4   2023      3   1393
5   2023      4   1292
6   2023      5   1212
7   2023      6   1335
8   2023      7   1362
9   2023      8   1768
10  2023      9   1873
11  2023     10   1812
12  2023     11   2492
13  2023     12    645

**Query 10: Number of Jobs by Location (Top 10)**

In [49]:
query10 = "SELECT location, COUNT(*) AS job_count FROM jobs GROUP BY location ORDER BY COUNT(*) DESC LIMIT 10;"
pd.read_sql_query(query10, engine)

        location  job_count
0       Anywhere       9142
1  Not-Specified       4692
2         Kansas        942
3       Missouri        922
4     California        820
5         Madrid        809
6      Catalonia        690
7       Oklahoma        653
8       New York        437
9       Arkansas        420

**Query 11: Skills Frequency by Role**

In [50]:
pd.set_option('display.max_rows', 257)
query11 = """
SELECT role, skill, skill_count
FROM (
    SELECT 
        jobs.role, 
        skills.skill, 
        COUNT(*) AS skill_count,
        ROW_NUMBER() OVER (PARTITION BY jobs.role ORDER BY COUNT(*) DESC) AS rn
    FROM jobs
    JOIN jobs_x_skills ON jobs.job_id = jobs_x_skills.job_id
    JOIN skills ON jobs_x_skills.skill_id = skills.id
    GROUP BY jobs.role, skills.skill
) ranked
WHERE rn <= 5;
"""
pd.read_sql_query(query11, engine)

                                     role          skill  skill_count
0                        Business Analyst            sql          481
1                        Business Analyst       power_bi          378
2                        Business Analyst          excel          274
3                        Business Analyst        tableau          266
4                        Business Analyst         python          158
5               Business Analyst Director            sql            2
6               Business Analyst Director      atlassian            1
7               Business Analyst Director       bigquery            1
8               Business Analyst Director         gitlab            1
9               Business Analyst Director      snowflake            1
10            Business Analyst Internship            sql           12
11            Business Analyst Internship         python           10
12            Business Analyst Internship       power_bi            8
13            Business Analyst Internship        tableau            8
14            Business Analyst Internship              r            8
15                Business Analyst Junior            sql           54
16                Business Analyst Junior          excel           39
17                Business Analyst Junior        tableau           35
18                Business Analyst Junior       power_bi           28
19                Business Analyst Junior         python           21
20               Business Analyst Manager            sql           23
21               Business Analyst Manager        tableau           17
22               Business Analyst Manager         python           14
23               Business Analyst Manager       power_bi           14
24               Business Analyst Manager          excel            8
25            Business Analyst Mid-Senior            sql           90
26            Business Analyst Mid-Senior       power_bi           46
27            Business Analyst Mid-Senior        tableau           46
28            Business Analyst Mid-Senior          excel           40
29            Business Analyst Mid-Senior         python           39
30                Business Analyst Senior            sql          234
31                Business Analyst Senior       power_bi          162
32                Business Analyst Senior        tableau          133
33                Business Analyst Senior          excel          125
34                Business Analyst Senior         python           85
35                         Cloud Engineer          azure           21
36                         Cloud Engineer            aws           19
37                         Cloud Engineer            sql           19
38                         Cloud Engineer       power_bi           16
39                         Cloud Engineer         python           13
40              Cloud Engineer Internship         spring            1
41              Cloud Engineer Internship        angular            1
42              Cloud Engineer Internship           java            1
43              Cloud Engineer Internship     javascript            1
44                  Cloud Engineer Junior         python           13
45                  Cloud Engineer Junior          azure           11
46                  Cloud Engineer Junior            aws            9
47                  Cloud Engineer Junior            sql            9
48                  Cloud Engineer Junior          spark            6
49                 Cloud Engineer Manager            sql            3
50                 Cloud Engineer Manager         looker            1
51                 Cloud Engineer Manager  microstrategy            1
52                 Cloud Engineer Manager         python            1
53                 Cloud Engineer Manager            gcp            1
54              Cloud Engineer Mid-Senior            aws            6
55              Cloud Engineer Mid-Senior          azure            6
56              Cloud Engineer Mid-Senior         python            6
57              Cloud Engineer Mid-Senior            sql            5
58              Cloud Engineer Mid-Senior          scala            2
59                  Cloud Engineer Senior            sql           12
60                  Cloud Engineer Senior         python            8
61                  Cloud Engineer Senior            aws            7
62                  Cloud Engineer Senior          azure            6
63                  Cloud Engineer Senior          spark            6
64                           Data Analyst            sql         4147
65                           Data Analyst          excel         3457
66                           Data Analyst        tableau         2082
67                           Data Analyst         python         2055
68                           Data Analyst       power_bi         1969
69                  Data Analyst Director            sql           36
70                  Data Analyst Director         python           28
71                  Data Analyst Director        tableau           28
72                  Data Analyst Director       power_bi           26
73                  Data Analyst Director              r           24
74                Data Analyst Internship            sql          104
75                Data Analyst Internship          excel           97
76                Data Analyst Internship       power_bi           86
77                Data Analyst Internship         python           85
78                Data Analyst Internship        tableau           62
79                    Data Analyst Junior            sql          526
80                    Data Analyst Junior          excel          462
81                    Data Analyst Junior        tableau          280
82                    Data Analyst Junior         python          252
83                    Data Analyst Junior       power_bi          242
84                   Data Analyst Manager            sql          289
85                   Data Analyst Manager        tableau          199
86                   Data Analyst Manager         python          195
87                   Data Analyst Manager       power_bi          178
88                   Data Analyst Manager          excel          164
89                Data Analyst Mid-Senior            sql          550
90                Data Analyst Mid-Senior          excel          414
91                Data Analyst Mid-Senior       power_bi          288
92                Data Analyst Mid-Senior         python          271
93                Data Analyst Mid-Senior        tableau          264
94                    Data Analyst Senior            sql         2190
95                    Data Analyst Senior        tableau         1239
96                    Data Analyst Senior          excel         1139
97                    Data Analyst Senior         python         1125
98                    Data Analyst Senior       power_bi          982
99                          Data Engineer            sql          294
100                         Data Engineer         python          252
101                         Data Engineer            aws          132
102                         Data Engineer          azure          113
103                         Data Engineer          spark           87
104              Data Engineer Internship            sql            6
105              Data Engineer Internship         python            6
106              Data Engineer Internship          spark            4
107              Data Engineer Internship         hadoop            3
108              Data Engineer Internship           java            2
109                  Data Engineer Junior            sql           80
110                  Data Engineer Junior         python           73
111                  Data Engineer Junior            aws           61
112                  Data Engineer Junior          azure           46
113                  Data Engineer Junior          spark           41
114                 Data Engineer Manager            sql           17
115                 Data Engineer Manager         python           16
116                 Data Engineer Manager            aws           10
117                 Data Engineer Manager          spark            8
118                 Data Engineer Manager          azure            8
119              Data Engineer Mid-Senior            sql           54
120              Data Engineer Mid-Senior         python           50
121              Data Engineer Mid-Senior            aws           31
122              Data Engineer Mid-Senior          spark           29
123              Data Engineer Mid-Senior          scala           28
124                  Data Engineer Senior            sql          100
125                  Data Engineer Senior         python           81
126                  Data Engineer Senior            aws           56
127                  Data Engineer Senior          azure           47
128                  Data Engineer Senior          spark           38
129                        Data Scientist         python          509
130                        Data Scientist            sql          396
131                        Data Scientist              r          287
132                        Data Scientist        tableau          154
133                        Data Scientist       power_bi          120
134               Data Scientist Director              r           10
135               Data Scientist Director         python            9
136               Data Scientist Director            sql            7
137               Data Scientist Director          spark            5
138               Data Scientist Director     tensorflow            4
139             Data Scientist Internship         python           16
140             Data Scientist Internship            sql           12
141             Data Scientist Internship              r           10
142             Data Scientist Internship        tableau            5
143             Data Scientist Internship        seaborn            3
144                 Data Scientist Junior         python           80
145                 Data Scientist Junior            sql           51
146                 Data Scientist Junior              r           47
147                 Data Scientist Junior        tableau           25
148                 Data Scientist Junior         pandas           23
149                Data Scientist Manager         python           75
150                Data Scientist Manager            sql           61
151                Data Scientist Manager              r           46
152                Data Scientist Manager          spark           20
153                Data Scientist Manager     tensorflow           19
154             Data Scientist Mid-Senior         python           57
155             Data Scientist Mid-Senior            sql           48
156             Data Scientist Mid-Senior              r           33
157             Data Scientist Mid-Senior            sas           20
158             Data Scientist Mid-Senior        tableau           16
159                 Data Scientist Senior         python          148
160                 Data Scientist Senior            sql          125
161                 Data Scientist Senior              r           83
162                 Data Scientist Senior        tableau           48
163                 Data Scientist Senior            aws           33
164             Machine Learning Engineer         python           49
165             Machine Learning Engineer            sql           30
166             Machine Learning Engineer              r           22
167             Machine Learning Engineer            aws           15
168             Machine Learning Engineer          excel           14
169    Machine Learning Engineer Director        mongodb            2
170    Machine Learning Engineer Director              r            1
171    Machine Learning Engineer Director            sql            1
172    Machine Learning Engineer Director         python            1
173    Machine Learning Engineer Director         hadoop            1
174  Machine Learning Engineer Internship              r            1
175  Machine Learning Engineer Internship         looker            1
176  Machine Learning Engineer Internship            sql            1
177  Machine Learning Engineer Internship         python            1
178  Machine Learning Engineer Internship          excel            1
179      Machine Learning Engineer Junior         python           17
180      Machine Learning Engineer Junior          azure            8
181      Machine Learning Engineer Junior          react            6
182      Machine Learning Engineer Junior        pytorch            5
183      Machine Learning Engineer Junior            aws            5
184     Machine Learning Engineer Manager         python            9
185     Machine Learning Engineer Manager            sql            5
186     Machine Learning Engineer Manager          spark            4
187     Machine Learning Engineer Manager          scala            3
188     Machine Learning Engineer Manager              r            3
189  Machine Learning Engineer Mid-Senior         python           15
190  Machine Learning Engineer Mid-Senior            sql            8
191  Machine Learning Engineer Mid-Senior            aws            7
192  Machine Learning Engineer Mid-Senior     tensorflow            6
193  Machine Learning Engineer Mid-Senior        pytorch            5
194      Machine Learning Engineer Senior         python           32
195      Machine Learning Engineer Senior            aws           18
196      Machine Learning Engineer Senior            sql           14
197      Machine Learning Engineer Senior          azure           11
198      Machine Learning Engineer Senior              r            9
199                     Software Engineer            sql          180
200                     Software Engineer         python          101
201                     Software Engineer       power_bi           91
202                     Software Engineer        tableau           91
203                     Software Engineer          excel           76
204            Software Engineer Director         python            1
205            Software Engineer Director        pytorch            1
206            Software Engineer Director     tensorflow            1
207          Software Engineer Internship         python            4
208          Software Engineer Internship          excel            4
209          Software Engineer Internship              r            2
210          Software Engineer Internship           ruby            2
211          Software Engineer Internship       power_bi            1
212              Software Engineer Junior         python           67
213              Software Engineer Junior            sql           50
214              Software Engineer Junior          react           48
215              Software Engineer Junior           java           43
216              Software Engineer Junior     javascript           34
217             Software Engineer Manager       power_bi            5
218             Software Engineer Manager            sql            3
219             Software Engineer Manager         python            3
220             Software Engineer Manager          azure            3
221             Software Engineer Manager            sas            3
222          Software Engineer Mid-Senior            sql           44
223          Software Engineer Mid-Senior         python           38
224          Software Engineer Mid-Senior           java           33
225          Software Engineer Mid-Senior            aws           25
226          Software Engineer Mid-Senior     javascript           25
227              Software Engineer Senior            sql           73
228              Software Engineer Senior         python           48
229              Software Engineer Senior       power_bi           45
230              Software Engineer Senior          azure           37
231              Software Engineer Senior        tableau           26

**Query 12: Jobs with Salary Higher Than Average**

In [53]:
query12 = "SELECT * FROM jobs WHERE salary_standardized > (SELECT AVG(salary_standardized) FROM jobs);"
pd.read_sql_query(query12, engine)

,job_id,title,experience_level,title_cleaned,role,work_modality,company_name,location,via,schedule_type,salary_standardized,posted_date,search_location
0,eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,Data Analyst,Not-Specified,Data Analyst,Data Analyst,Remote,Meta,Anywhere,LinkedIn,Full-time,122000.0,2023-08-04,United States
1,eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgfCBXb3JrZm...,Data Analyst | Workforce Management,Not-Specified,Data Analyst,Data Analyst,On-Site,Krispy Kreme,Not-Specified,LinkedIn,Contractor,100000.0,2023-08-04,United States
2,eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0Ii...,Senior Data Analyst,Senior,Data Analyst,Data Analyst Senior,Remote,Aquent,Anywhere,LinkedIn,Full-time,119100.8,2023-08-04,United States
3,eyJqb2JfdGl0bGUiOiJNaWQtbGV2ZWwgQ2xhaW1zIERhdG...,Mid-level Claims Data Analyst,Mid-Senior,Data Analyst,Data Analyst Mid-Senior,On-Site,CIBA Insurance Services,Not-Specified,KSNT Jobs,Full-time,110000.0,2023-08-04,United States
4,eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5dGljcyBNZW50b3...,Data Analytics Mentor for Online Bootcamp,Not-Specified,Data Analyst,Data Analyst,Remote,Upwork,Anywhere,Upwork,Contractor,135200.0,2023-08-04,United States
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1579,eyJqb2JfdGl0bGUiOiJFcGlzeXMgQnVzaW5lc3MgQW5hbH...,Episys Business Analyst,Not-Specified,Business Analyst,Business Analyst,On-Site,"Trellance, Inc.",Not-Specified,Big Country Jobs,Full-time,95000.0,2022-11-20,United States
1580,eyJqb2JfdGl0bGUiOiJTZW5pb3IgQnVzaW5lc3MgU3lzdG...,Senior Business Systems Analyst (Remote),Senior,Business Analyst,Business Analyst Senior,On-Site,EDWARD JONES,Missouri,Big Country Jobs,Full-time,103781.0,2022-11-23,United States
1581,eyJqb2JfdGl0bGUiOiJEaWdpdGFsIFdlYiBBbmFseXN0IC...,Digital Web Analyst (Adobe Analytics),Not-Specified,Data Analyst,Data Analyst,On-Site,Harnham,Not-Specified,My ArkLaMiss Jobs,Full-time,114400.0,2022-12-04,United States
1582,eyJqb2JfdGl0bGUiOiJEYXRhIEVuZ2luZWVyL0FuYWx5c3...,Data Engineer/Analyst,Not-Specified,Data Engineer,Data Engineer,On-Site,Techveda Inc,Not-Specified,My ArkLaMiss Jobs,Full-time,125000.0,2022-11-04,United States
1583,eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IC...,Senior Data Analyst (ServiceNow),Senior,Data Analyst,Data Analyst Senior,On-Site,Applied Memetics L.L.C,Not-Specified,My ArkLaMiss Jobs,Full-time,105815.0,2023-02-25,United States

**Query 13: Roles with No Remote Work Option**

In [54]:
query13 = "SELECT DISTINCT role FROM jobs WHERE work_modality NOT LIKE %s;"
role_df = pd.read_sql_query(query13, engine, params=('%remote%',))

**Query 14: Skills Distribution by Experience Level**

In [59]:
pd.set_option('display.max_rows', 35)
query14 = """SELECT experience_level, skill, skill_count
FROM (
    SELECT 
        experience_level, 
        skills.skill, 
        COUNT(*) AS skill_count,
        ROW_NUMBER() OVER(PARTITION BY experience_level ORDER BY COUNT(*) DESC) AS rn
    FROM jobs
    JOIN jobs_x_skills ON jobs.job_id = jobs_x_skills.job_id
    JOIN skills ON jobs_x_skills.skill_id = skills.id
    WHERE experience_level IS NOT NULL
    GROUP BY experience_level, skills.skill
) ranked
WHERE rn <= 5;"""
pd.read_sql_query(query14, engine)

   experience_level     skill  skill_count
0          Director       sql           46
1          Director    python           40
2          Director         r           35
3          Director   tableau           32
4          Director  power_bi           30
5        Internship       sql          135
6        Internship    python          122
7        Internship     excel          112
8        Internship  power_bi           96
9        Internship   tableau           77
10           Junior       sql          775
11           Junior     excel          524
12           Junior    python          523
13           Junior   tableau          372
14           Junior  power_bi          292
15          Manager       sql          401
16          Manager    python          313
17          Manager   tableau          243
18          Manager         r          211
19          Manager  power_bi          210
20       Mid-Senior       sql          799
21       Mid-Senior     excel          482
22       Mid-Senior    python          476
23       Mid-Senior  power_bi          352
24       Mid-Senior   tableau          344
25    Not-Specified       sql         5534
26    Not-Specified     excel         3982
27    Not-Specified    python         3120
28    Not-Specified   tableau         2681
29    Not-Specified  power_bi         2655
30           Senior       sql         2748
31           Senior    python         1527
32           Senior   tableau         1479
33           Senior     excel         1323
34           Senior  power_bi         1237

**Query 15: Jobs Posted by Month**

In [61]:
query15 = "SELECT EXTRACT(MONTH FROM posted_date) AS Month, COUNT(*) FROM jobs GROUP BY Month ORDER BY Month;"
pd.read_sql_query(query15, engine)

    Month  COUNT(*)
0       1      1826
1       2      1355
2       3      1393
3       4      1292
4       5      1212
5       6      1335
6       7      1362
7       8      1768
8       9      1873
9      10      1812
10     11      3717
11     12      2469

**Query 16: Most Demanded Skills in High Salary Jobs**

In [86]:
query16 = """SELECT skills.skill, COUNT(*) 
FROM skills 
JOIN jobs_x_skills ON skills.id = jobs_x_skills.skill_id 
JOIN jobs ON jobs_x_skills.job_id = jobs.job_id 
WHERE jobs.salary_standardized > (SELECT AVG(salary_standardized) FROM jobs) 
GROUP BY skills.skill 
ORDER BY COUNT(*) DESC 
LIMIT 10;
"""
pd.read_sql_query(query16, engine)

       skill  COUNT(*)
0        sql       736
1     python       442
2      excel       340
3    tableau       329
4   power_bi       328
5          r       221
6        aws       126
7  snowflake       113
8        sas        99
9      azure        99

**Query 17: Comparison of Full-time vs Part-time Jobs**

In [66]:
query17 = "SELECT schedule_type, COUNT(*) FROM jobs GROUP BY schedule_type;"
pd.read_sql_query(query17, engine)

  schedule_type  COUNT(*)
0     Full-time     15305
1    Contractor      5701
2     Part-time       250
3    Internship       158

**Query 18: Jobs with Most Diverse Skill Requirements**

In [76]:
query18 = """
SELECT jobs.job_id, jobs.title, jobs.role, COUNT(jobs_x_skills.skill_id) AS skill_count
FROM jobs_x_skills
JOIN jobs ON jobs.job_id = jobs_x_skills.job_id
GROUP BY jobs.job_id, jobs.title, jobs.role
ORDER BY skill_count DESC 
LIMIT 10;
"""
pd.read_sql_query(query18, engine)

                                              job_id  ... skill_count
0  eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgRGF0YSBTY2llbn...  ...          24
1  eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImh0aW...  ...          23
2  eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QvRGF0YSBWaX...  ...          21
3  eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBFbmdpbmVlci...  ...          21
4  eyJqb2JfdGl0bGUiOiJEYXRhIFdhcmVob3N1ZSBEZXZlbG...  ...          20
5  eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0LU...  ...          19
6  eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImh0aW...  ...          19
7  eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0Ii...  ...          19
8  eyJqb2JfdGl0bGUiOiJEYXRhIFNjaWVudGlzdCIsImh0aW...  ...          19
9  eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0Ii...  ...          19

[10 rows x 4 columns]

**Query 19: Trend of Remote works**

In [78]:
query19 = "SELECT YEAR(posted_date) AS Year, MONTH(posted_date) AS Month, COUNT(*) FROM jobs WHERE work_modality LIKE '%%remote%%' GROUP BY Year, Month ORDER BY Year, Month;"
pd.read_sql_query(query19, engine)

    Year  Month  COUNT(*)
0   2022     11       732
1   2022     12      1061
2   2023      1      1055
3   2023      2       686
4   2023      3       716
..   ...    ...       ...
8   2023      7       788
9   2023      8       653
10  2023      9       956
11  2023     10       973
12  2023     11       738

[13 rows x 3 columns]

**Query 20: Average Salary by Location**

In [80]:
query20 = """
SELECT location, AVG(salary_standardized) AS average_salary 
FROM jobs 
WHERE salary_standardized IS NOT NULL
GROUP BY location;
"""
pd.read_sql_query(query20, engine)

         location  average_salary
0        Anywhere    93710.238774
1   Not-Specified   103818.877415
2        Missouri    71590.053696
3        Oklahoma    81046.500000
4        Arkansas    77330.560000
..            ...             ...
38          Idaho    52743.600000
39       Michigan   110000.000000
40   South Dakota    67315.860000
41     New Mexico   102500.000000
42       Delaware    70000.000000

[43 rows x 2 columns]

## Exporting tables to CSV

In [91]:
query_skills = "SELECT * FROM skills"
df_skills_table = pd.read_sql_query(query_skills, engine)
df_skills_table.to_csv('../data/skills_table.csv', index=False)

In [92]:
query_jobs = "SELECT * FROM jobs"
df_jobs_table = pd.read_sql_query(query_jobs, engine)
df_jobs_table.to_csv('../data/jobs_table.csv', index=False)

In [93]:
query_jxs = "SELECT * FROM jobs_x_skills"
df_jxs_table = pd.read_sql_query(query_jxs, engine)
df_jxs_table.to_csv('../data/jxs_table.csv', index=False)